{"class_name": "Sequential", "keras_version": "2.0.5", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "batch_input_shape": [null, 240, 320, 1], "name": "conv2d_1", "kernel_size": [8, 8], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dtype": "float32", "activity_regularizer": null, "strides": [4, 4], "bias_regularizer": null, "filters": 16, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "momentum": 0.99, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv2d_2", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "filters": 32, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "momentum": 0.99, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv2d_3", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "filters": 32, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "momentum": 0.99, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv2d_4", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "filters": 64, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "momentum": 0.99, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv2d_5", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "filters": 64, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "momentum": 0.99, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv2d_6", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "filters": 128, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "momentum": 0.99, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv2d_7", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "filters": 128, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "momentum": 0.99, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 1024, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "momentum": 0.99, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 512, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "momentum": 0.99, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 1, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "activation": "tanh"}}]}