{"backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 240, 320, 1], "name": "conv2d_1", "dtype": "float32", "kernel_regularizer": null, "data_format": "channels_last", "filters": 16, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "same", "strides": [4, 4], "kernel_size": [8, 8]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "conv2d_2", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "filters": 32, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "conv2d_3", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "filters": 32, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "same", "strides": [2, 2], "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "conv2d_4", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "conv2d_5", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "same", "strides": [2, 2], "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "conv2d_6", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "filters": 128, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "conv2d_7", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "filters": 128, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "same", "strides": [2, 2], "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "activation": "linear", "units": 1024, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_2", "bias_regularizer": null, "activation": "linear", "units": 512, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_3", "bias_regularizer": null, "activation": "tanh", "units": 1, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}}}], "keras_version": "2.0.4", "class_name": "Sequential"}