{"config": [{"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "trainable": true, "activation": "linear", "filters": 16, "bias_regularizer": null, "kernel_size": [8, 8], "data_format": "channels_last", "padding": "same", "strides": [4, 4], "kernel_constraint": null, "dtype": "float32", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 240, 320, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "filters": 32, "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "filters": 32, "strides": [2, 2], "kernel_constraint": null, "bias_constraint": null, "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "filters": 64, "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_4", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "filters": 64, "strides": [2, 2], "kernel_constraint": null, "bias_constraint": null, "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_5", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_6", "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "filters": 128, "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_6", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_7", "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "filters": 128, "strides": [2, 2], "kernel_constraint": null, "bias_constraint": null, "padding": "same", "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_7", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "units": 512}, "class_name": "Dense"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_8", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "tanh", "units": 1}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.5", "class_name": "Sequential"}